tests/cassettes/test_refund_create.yaml

interactions:
- request:
    body: '{"shipment": {"to_address": {"name": "Jack Sparrow", "street1": "388 Townsend
      St", "street2": "Apt 20", "city": "San Francisco", "state": "CA", "zip": "94107",
      "country": "US", "email": "test@example.com", "phone": "5555555555"}, "from_address":
      {"name": "Elizabeth Swan", "street1": "179 N Harbor Dr", "city": "Redondo Beach",
      "state": "CA", "zip": "90277", "country": "US", "email": "test@example.com",
      "phone": "5555555555"}, "parcel": {"length": 10, "width": 8, "height": 4, "weight":
      15.4}, "service": "First", "carrier_accounts": ["ca_b25657e9896e4d63ac8151ac346ac41e"],
      "carrier": "USPS"}}'
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '596'
      Content-Type:
      - application/json
      authorization:
      - <REDACTED>
      user-agent:
      - <REDACTED>
    method: POST
    uri: https://api.easypost.com/v2/shipments
  response:
    body:
      string: '{"created_at": "2023-11-28T22:04:14Z", "is_return": false, "messages":
        [], "mode": "test", "options": {"currency": "USD", "payment": {"type": "SENDER"},
        "date_advance": 0}, "reference": null, "status": "unknown", "tracking_code":
        "9400100105442285865323", "updated_at": "2023-11-28T22:04:14Z", "batch_id":
        null, "batch_status": null, "batch_message": null, "customs_info": null, "from_address":
        {"id": "adr_112114878e3a11ee94313cecef1b359e", "object": "Address", "created_at":
        "2023-11-28T22:04:14+00:00", "updated_at": "2023-11-28T22:04:14+00:00", "name":
        "Elizabeth Swan", "company": null, "street1": "179 N Harbor Dr", "street2":
        null, "city": "Redondo Beach", "state": "CA", "zip": "90277", "country": "US",
        "phone": "<REDACTED>", "email": "<REDACTED>", "mode": "test", "carrier_facility":
        null, "residential": null, "federal_tax_id": null, "state_tax_id": null, "verifications":
        {}}, "insurance": null, "order_id": null, "parcel": {"id": "prcl_c14abe119b4b47cca0eaffefa64ec311",
        "object": "Parcel", "created_at": "2023-11-28T22:04:14Z", "updated_at": "2023-11-28T22:04:14Z",
        "length": 10.0, "width": 8.0, "height": 4.0, "predefined_package": null, "weight":
        15.4, "mode": "test"}, "postage_label": {"object": "PostageLabel", "id": "pl_f5482c5ee9694dc2aaf344cd96b84259",
        "created_at": "2023-11-28T22:04:14Z", "updated_at": "2023-11-28T22:04:14Z",
        "date_advance": 0, "integrated_form": "none", "label_date": "2023-11-28T22:04:14Z",
        "label_resolution": 300, "label_size": "4x6", "label_type": "default", "label_file_type":
        "image/png", "label_url": "https://easypost-files.s3.us-west-2.amazonaws.com/files/postage_label/20231128/e8c8b82e8339f94b608d71b001b7c22082.png",
        "label_pdf_url": null, "label_zpl_url": null, "label_epl2_url": null, "label_file":
        null}, "rates": [{"id": "rate_f7fc0d50e1c54a7f94d19d07d83527e2", "object":
        "Rate", "created_at": "2023-11-28T22:04:14Z", "updated_at": "2023-11-28T22:04:14Z",
        "mode": "test", "service": "Priority", "carrier": "USPS", "rate": "6.95",
        "currency": "USD", "retail_rate": "10.20", "retail_currency": "USD", "list_rate":
        "8.24", "list_currency": "USD", "billing_type": "easypost", "delivery_days":
        2, "delivery_date": null, "delivery_date_guaranteed": false, "est_delivery_days":
        2, "shipment_id": "shp_389b05acbbff44bfa104ee937676bace", "carrier_account_id":
        "ca_b25657e9896e4d63ac8151ac346ac41e"}, {"id": "rate_0f1537b73e7b445b86a0a34b139a0bbc",
        "object": "Rate", "created_at": "2023-11-28T22:04:14Z", "updated_at": "2023-11-28T22:04:14Z",
        "mode": "test", "service": "GroundAdvantage", "carrier": "USPS", "rate": "5.93",
        "currency": "USD", "retail_rate": "8.00", "retail_currency": "USD", "list_rate":
        "6.07", "list_currency": "USD", "billing_type": "easypost", "delivery_days":
        3, "delivery_date": null, "delivery_date_guaranteed": false, "est_delivery_days":
        3, "shipment_id": "shp_389b05acbbff44bfa104ee937676bace", "carrier_account_id":
        "ca_b25657e9896e4d63ac8151ac346ac41e"}, {"id": "rate_14f869b274414bc2a26bfd40b791eaaf",
        "object": "Rate", "created_at": "2023-11-28T22:04:14Z", "updated_at": "2023-11-28T22:04:14Z",
        "mode": "test", "service": "First", "carrier": "USPS", "rate": "5.93", "currency":
        "USD", "retail_rate": "8.00", "retail_currency": "USD", "list_rate": "6.07",
        "list_currency": "USD", "billing_type": "easypost", "delivery_days": 3, "delivery_date":
        null, "delivery_date_guaranteed": false, "est_delivery_days": 3, "shipment_id":
        "shp_389b05acbbff44bfa104ee937676bace", "carrier_account_id": "ca_b25657e9896e4d63ac8151ac346ac41e"},
        {"id": "rate_252d16804f6a4914990c7927640dc139", "object": "Rate", "created_at":
        "2023-11-28T22:04:14Z", "updated_at": "2023-11-28T22:04:14Z", "mode": "test",
        "service": "ParcelSelect", "carrier": "USPS", "rate": "5.93", "currency":
        "USD", "retail_rate": "8.00", "retail_currency": "USD", "list_rate": "6.07",
        "list_currency": "USD", "billing_type": "easypost", "delivery_days": 3, "delivery_date":
        null, "delivery_date_guaranteed": false, "est_delivery_days": 3, "shipment_id":
        "shp_389b05acbbff44bfa104ee937676bace", "carrier_account_id": "ca_b25657e9896e4d63ac8151ac346ac41e"},
        {"id": "rate_550711dcaca14d96a311eedb314dbb30", "object": "Rate", "created_at":
        "2023-11-28T22:04:14Z", "updated_at": "2023-11-28T22:04:14Z", "mode": "test",
        "service": "Express", "carrier": "USPS", "rate": "31.25", "currency": "USD",
        "retail_rate": "35.80", "retail_currency": "USD", "list_rate": "31.25", "list_currency":
        "USD", "billing_type": "easypost", "delivery_days": null, "delivery_date":
        null, "delivery_date_guaranteed": false, "est_delivery_days": null, "shipment_id":
        "shp_389b05acbbff44bfa104ee937676bace", "carrier_account_id": "ca_b25657e9896e4d63ac8151ac346ac41e"}],
        "refund_status": null, "scan_form": null, "selected_rate": {"id": "rate_14f869b274414bc2a26bfd40b791eaaf",
        "object": "Rate", "created_at": "2023-11-28T22:04:14Z", "updated_at": "2023-11-28T22:04:14Z",
        "mode": "test", "service": "First", "carrier": "USPS", "rate": "5.93", "currency":
        "USD", "retail_rate": "8.00", "retail_currency": "USD", "list_rate": "6.07",
        "list_currency": "USD", "billing_type": "easypost", "delivery_days": 3, "delivery_date":
        null, "delivery_date_guaranteed": false, "est_delivery_days": 3, "shipment_id":
        "shp_389b05acbbff44bfa104ee937676bace", "carrier_account_id": "ca_b25657e9896e4d63ac8151ac346ac41e"},
        "tracker": {"id": "trk_f7228e9b353c4d22820956036c86fcc8", "object": "Tracker",
        "mode": "test", "tracking_code": "9400100105442285865323", "status": "unknown",
        "status_detail": "unknown", "created_at": "2023-11-28T22:04:15Z", "updated_at":
        "2023-11-28T22:04:15Z", "signed_by": null, "weight": null, "est_delivery_date":
        null, "shipment_id": "shp_389b05acbbff44bfa104ee937676bace", "carrier": "USPS",
        "tracking_details": [], "fees": [], "carrier_detail": null, "public_url":
        "https://track.easypost.com/djE6dHJrX2Y3MjI4ZTliMzUzYzRkMjI4MjA5NTYwMzZjODZmY2M4"},
        "to_address": {"id": "adr_111e48828e3a11ee9f7dac1f6bc539aa", "object": "Address",
        "created_at": "2023-11-28T22:04:14+00:00", "updated_at": "2023-11-28T22:04:14+00:00",
        "name": "JACK SPARROW", "company": null, "street1": "388 TOWNSEND ST APT 20",
        "street2": "", "city": "SAN FRANCISCO", "state": "CA", "zip": "94107-1670",
        "country": "US", "phone": "<REDACTED>", "email": "<REDACTED>", "mode": "test",
        "carrier_facility": null, "residential": true, "federal_tax_id": null, "state_tax_id":
        null, "verifications": {"zip4": {"success": true, "errors": [], "details":
        null}, "delivery": {"success": true, "errors": [], "details": {"latitude":
        37.77551, "longitude": -122.39697, "time_zone": "America/Los_Angeles"}}}},
        "usps_zone": 4, "return_address": {"id": "adr_112114878e3a11ee94313cecef1b359e",
        "object": "Address", "created_at": "2023-11-28T22:04:14+00:00", "updated_at":
        "2023-11-28T22:04:14+00:00", "name": "Elizabeth Swan", "company": null, "street1":
        "179 N Harbor Dr", "street2": null, "city": "Redondo Beach", "state": "CA",
        "zip": "90277", "country": "US", "phone": "<REDACTED>", "email": "<REDACTED>",
        "mode": "test", "carrier_facility": null, "residential": null, "federal_tax_id":
        null, "state_tax_id": null, "verifications": {}}, "buyer_address": {"id":
        "adr_111e48828e3a11ee9f7dac1f6bc539aa", "object": "Address", "created_at":
        "2023-11-28T22:04:14+00:00", "updated_at": "2023-11-28T22:04:14+00:00", "name":
        "JACK SPARROW", "company": null, "street1": "388 TOWNSEND ST APT 20", "street2":
        "", "city": "SAN FRANCISCO", "state": "CA", "zip": "94107-1670", "country":
        "US", "phone": "<REDACTED>", "email": "<REDACTED>", "mode": "test", "carrier_facility":
        null, "residential": true, "federal_tax_id": null, "state_tax_id": null, "verifications":
        {"zip4": {"success": true, "errors": [], "details": null}, "delivery": {"success":
        true, "errors": [], "details": {"latitude": 37.77551, "longitude": -122.39697,
        "time_zone": "America/Los_Angeles"}}}}, "forms": [], "fees": [{"object": "Fee",
        "type": "LabelFee", "amount": "0.00000", "charged": true, "refunded": false},
        {"object": "Fee", "type": "PostageFee", "amount": "5.93000", "charged": true,
        "refunded": false}], "id": "shp_389b05acbbff44bfa104ee937676bace", "object":
        "Shipment"}'
    headers:
      cache-control:
      - private, no-cache, no-store
      content-length:
      - '7526'
      content-type:
      - application/json; charset=utf-8
      expires:
      - '0'
      location:
      - /api/v2/shipments/shp_389b05acbbff44bfa104ee937676bace
      pragma:
      - no-cache
      referrer-policy:
      - strict-origin-when-cross-origin
      strict-transport-security:
      - max-age=31536000; includeSubDomains; preload
      transfer-encoding:
      - chunked
      x-backend:
      - easypost
      x-content-type-options:
      - nosniff
      x-download-options:
      - noopen
      x-ep-request-uuid:
      - 88ad7b8f656663dee78a97f0003e3c61
      x-frame-options:
      - SAMEORIGIN
      x-node:
      - bigweb41nuq
      x-permitted-cross-domain-policies:
      - none
      x-proxied:
      - intlb2nuq b3de2c47ef
      - extlb1nuq 003ad9bca0
      x-runtime:
      - '0.933412'
      x-version-label:
      - easypost-202311250013-a0f06fbc2c-master
      x-xss-protection:
      - 1; mode=block
    status:
      code: 201
      message: Created
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      authorization:
      - <REDACTED>
      user-agent:
      - <REDACTED>
    method: GET
    uri: https://api.easypost.com/v2/shipments/shp_389b05acbbff44bfa104ee937676bace
  response:
    body:
      string: '{"created_at": "2023-11-28T22:04:14Z", "is_return": false, "messages":
        [], "mode": "test", "options": {"currency": "USD", "payment": {"type": "SENDER"},
        "date_advance": 0}, "reference": null, "status": "unknown", "tracking_code":
        "9400100105442285865323", "updated_at": "2023-11-28T22:04:14Z", "batch_id":
        null, "batch_status": null, "batch_message": null, "customs_info": null, "from_address":
        {"id": "adr_112114878e3a11ee94313cecef1b359e", "object": "Address", "created_at":
        "2023-11-28T22:04:14+00:00", "updated_at": "2023-11-28T22:04:14+00:00", "name":
        "Elizabeth Swan", "company": null, "street1": "179 N Harbor Dr", "street2":
        null, "city": "Redondo Beach", "state": "CA", "zip": "90277", "country": "US",
        "phone": "<REDACTED>", "email": "<REDACTED>", "mode": "test", "carrier_facility":
        null, "residential": null, "federal_tax_id": null, "state_tax_id": null, "verifications":
        {}}, "insurance": null, "order_id": null, "parcel": {"id": "prcl_c14abe119b4b47cca0eaffefa64ec311",
        "object": "Parcel", "created_at": "2023-11-28T22:04:14Z", "updated_at": "2023-11-28T22:04:14Z",
        "length": 10.0, "width": 8.0, "height": 4.0, "predefined_package": null, "weight":
        15.4, "mode": "test"}, "postage_label": {"object": "PostageLabel", "id": "pl_f5482c5ee9694dc2aaf344cd96b84259",
        "created_at": "2023-11-28T22:04:14Z", "updated_at": "2023-11-28T22:04:14Z",
        "date_advance": 0, "integrated_form": "none", "label_date": "2023-11-28T22:04:14Z",
        "label_resolution": 300, "label_size": "4x6", "label_type": "default", "label_file_type":
        "image/png", "label_url": "https://easypost-files.s3.us-west-2.amazonaws.com/files/postage_label/20231128/e8c8b82e8339f94b608d71b001b7c22082.png",
        "label_pdf_url": null, "label_zpl_url": null, "label_epl2_url": null, "label_file":
        null}, "rates": [{"id": "rate_f7fc0d50e1c54a7f94d19d07d83527e2", "object":
        "Rate", "created_at": "2023-11-28T22:04:14Z", "updated_at": "2023-11-28T22:04:14Z",
        "mode": "test", "service": "Priority", "carrier": "USPS", "rate": "6.95",
        "currency": "USD", "retail_rate": "10.20", "retail_currency": "USD", "list_rate":
        "8.24", "list_currency": "USD", "billing_type": "easypost", "delivery_days":
        2, "delivery_date": null, "delivery_date_guaranteed": false, "est_delivery_days":
        2, "shipment_id": "shp_389b05acbbff44bfa104ee937676bace", "carrier_account_id":
        "ca_b25657e9896e4d63ac8151ac346ac41e"}, {"id": "rate_0f1537b73e7b445b86a0a34b139a0bbc",
        "object": "Rate", "created_at": "2023-11-28T22:04:14Z", "updated_at": "2023-11-28T22:04:14Z",
        "mode": "test", "service": "GroundAdvantage", "carrier": "USPS", "rate": "5.93",
        "currency": "USD", "retail_rate": "8.00", "retail_currency": "USD", "list_rate":
        "6.07", "list_currency": "USD", "billing_type": "easypost", "delivery_days":
        3, "delivery_date": null, "delivery_date_guaranteed": false, "est_delivery_days":
        3, "shipment_id": "shp_389b05acbbff44bfa104ee937676bace", "carrier_account_id":
        "ca_b25657e9896e4d63ac8151ac346ac41e"}, {"id": "rate_14f869b274414bc2a26bfd40b791eaaf",
        "object": "Rate", "created_at": "2023-11-28T22:04:14Z", "updated_at": "2023-11-28T22:04:14Z",
        "mode": "test", "service": "First", "carrier": "USPS", "rate": "5.93", "currency":
        "USD", "retail_rate": "8.00", "retail_currency": "USD", "list_rate": "6.07",
        "list_currency": "USD", "billing_type": "easypost", "delivery_days": 3, "delivery_date":
        null, "delivery_date_guaranteed": false, "est_delivery_days": 3, "shipment_id":
        "shp_389b05acbbff44bfa104ee937676bace", "carrier_account_id": "ca_b25657e9896e4d63ac8151ac346ac41e"},
        {"id": "rate_252d16804f6a4914990c7927640dc139", "object": "Rate", "created_at":
        "2023-11-28T22:04:14Z", "updated_at": "2023-11-28T22:04:14Z", "mode": "test",
        "service": "ParcelSelect", "carrier": "USPS", "rate": "5.93", "currency":
        "USD", "retail_rate": "8.00", "retail_currency": "USD", "list_rate": "6.07",
        "list_currency": "USD", "billing_type": "easypost", "delivery_days": 3, "delivery_date":
        null, "delivery_date_guaranteed": false, "est_delivery_days": 3, "shipment_id":
        "shp_389b05acbbff44bfa104ee937676bace", "carrier_account_id": "ca_b25657e9896e4d63ac8151ac346ac41e"},
        {"id": "rate_550711dcaca14d96a311eedb314dbb30", "object": "Rate", "created_at":
        "2023-11-28T22:04:14Z", "updated_at": "2023-11-28T22:04:14Z", "mode": "test",
        "service": "Express", "carrier": "USPS", "rate": "31.25", "currency": "USD",
        "retail_rate": "35.80", "retail_currency": "USD", "list_rate": "31.25", "list_currency":
        "USD", "billing_type": "easypost", "delivery_days": null, "delivery_date":
        null, "delivery_date_guaranteed": false, "est_delivery_days": null, "shipment_id":
        "shp_389b05acbbff44bfa104ee937676bace", "carrier_account_id": "ca_b25657e9896e4d63ac8151ac346ac41e"}],
        "refund_status": null, "scan_form": null, "selected_rate": {"id": "rate_14f869b274414bc2a26bfd40b791eaaf",
        "object": "Rate", "created_at": "2023-11-28T22:04:14Z", "updated_at": "2023-11-28T22:04:14Z",
        "mode": "test", "service": "First", "carrier": "USPS", "rate": "5.93", "currency":
        "USD", "retail_rate": "8.00", "retail_currency": "USD", "list_rate": "6.07",
        "list_currency": "USD", "billing_type": "easypost", "delivery_days": 3, "delivery_date":
        null, "delivery_date_guaranteed": false, "est_delivery_days": 3, "shipment_id":
        "shp_389b05acbbff44bfa104ee937676bace", "carrier_account_id": "ca_b25657e9896e4d63ac8151ac346ac41e"},
        "tracker": {"id": "trk_f7228e9b353c4d22820956036c86fcc8", "object": "Tracker",
        "mode": "test", "tracking_code": "9400100105442285865323", "status": "pre_transit",
        "status_detail": "status_update", "created_at": "2023-11-28T22:04:15Z", "updated_at":
        "2023-11-28T22:04:15Z", "signed_by": null, "weight": null, "est_delivery_date":
        "2023-11-28T22:04:15Z", "shipment_id": "shp_389b05acbbff44bfa104ee937676bace",
        "carrier": "USPS", "tracking_details": [{"object": "TrackingDetail", "message":
        "Pre-Shipment Info Sent to USPS", "description": "", "status": "pre_transit",
        "status_detail": "status_update", "datetime": "2023-10-28T22:04:15Z", "source":
        "USPS", "carrier_code": "", "tracking_location": {"object": "TrackingLocation",
        "city": null, "state": null, "country": null, "zip": null}}, {"object": "TrackingDetail",
        "message": "Shipping Label Created", "description": "", "status": "pre_transit",
        "status_detail": "status_update", "datetime": "2023-10-29T10:41:15Z", "source":
        "USPS", "carrier_code": "", "tracking_location": {"object": "TrackingLocation",
        "city": "HOUSTON", "state": "TX", "country": null, "zip": "77063"}}], "fees":
        [], "carrier_detail": {"object": "CarrierDetail", "service": "First-Class
        Package Service", "container_type": null, "est_delivery_date_local": null,
        "est_delivery_time_local": null, "origin_location": "HOUSTON TX, 77001", "origin_tracking_location":
        {"object": "TrackingLocation", "city": "HOUSTON", "state": "TX", "country":
        null, "zip": "77063"}, "destination_location": "CHARLESTON SC, 29401", "destination_tracking_location":
        null, "guaranteed_delivery_date": null, "alternate_identifier": null, "initial_delivery_attempt":
        null}, "public_url": "https://track.easypost.com/djE6dHJrX2Y3MjI4ZTliMzUzYzRkMjI4MjA5NTYwMzZjODZmY2M4"},
        "to_address": {"id": "adr_111e48828e3a11ee9f7dac1f6bc539aa", "object": "Address",
        "created_at": "2023-11-28T22:04:14+00:00", "updated_at": "2023-11-28T22:04:14+00:00",
        "name": "JACK SPARROW", "company": null, "street1": "388 TOWNSEND ST APT 20",
        "street2": null, "city": "SAN FRANCISCO", "state": "CA", "zip": "94107-1670",
        "country": "US", "phone": "<REDACTED>", "email": "<REDACTED>", "mode": "test",
        "carrier_facility": null, "residential": true, "federal_tax_id": null, "state_tax_id":
        null, "verifications": {"zip4": {"success": true, "errors": [], "details":
        null}, "delivery": {"success": true, "errors": [], "details": {"latitude":
        37.77551, "longitude": -122.39697, "time_zone": "America/Los_Angeles"}}}},
        "usps_zone": 4, "return_address": {"id": "adr_112114878e3a11ee94313cecef1b359e",
        "object": "Address", "created_at": "2023-11-28T22:04:14+00:00", "updated_at":
        "2023-11-28T22:04:14+00:00", "name": "Elizabeth Swan", "company": null, "street1":
        "179 N Harbor Dr", "street2": null, "city": "Redondo Beach", "state": "CA",
        "zip": "90277", "country": "US", "phone": "<REDACTED>", "email": "<REDACTED>",
        "mode": "test", "carrier_facility": null, "residential": null, "federal_tax_id":
        null, "state_tax_id": null, "verifications": {}}, "buyer_address": {"id":
        "adr_111e48828e3a11ee9f7dac1f6bc539aa", "object": "Address", "created_at":
        "2023-11-28T22:04:14+00:00", "updated_at": "2023-11-28T22:04:14+00:00", "name":
        "JACK SPARROW", "company": null, "street1": "388 TOWNSEND ST APT 20", "street2":
        null, "city": "SAN FRANCISCO", "state": "CA", "zip": "94107-1670", "country":
        "US", "phone": "<REDACTED>", "email": "<REDACTED>", "mode": "test", "carrier_facility":
        null, "residential": true, "federal_tax_id": null, "state_tax_id": null, "verifications":
        {"zip4": {"success": true, "errors": [], "details": null}, "delivery": {"success":
        true, "errors": [], "details": {"latitude": 37.77551, "longitude": -122.39697,
        "time_zone": "America/Los_Angeles"}}}}, "forms": [], "fees": [{"object": "Fee",
        "type": "LabelFee", "amount": "0.00000", "charged": true, "refunded": false},
        {"object": "Fee", "type": "PostageFee", "amount": "5.93000", "charged": true,
        "refunded": false}], "id": "shp_389b05acbbff44bfa104ee937676bace", "object":
        "Shipment"}'
    headers:
      cache-control:
      - private, no-cache, no-store
      content-length:
      - '8656'
      content-type:
      - application/json; charset=utf-8
      expires:
      - '0'
      pragma:
      - no-cache
      referrer-policy:
      - strict-origin-when-cross-origin
      strict-transport-security:
      - max-age=31536000; includeSubDomains; preload
      transfer-encoding:
      - chunked
      x-backend:
      - easypost
      x-content-type-options:
      - nosniff
      x-download-options:
      - noopen
      x-ep-request-uuid:
      - 88ad7b8f656663dfe78a97f0003e3d9d
      x-frame-options:
      - SAMEORIGIN
      x-node:
      - bigweb35nuq
      x-permitted-cross-domain-policies:
      - none
      x-proxied:
      - intlb2nuq b3de2c47ef
      - extlb1nuq 003ad9bca0
      x-runtime:
      - '0.136542'
      x-version-label:
      - easypost-202311250013-a0f06fbc2c-master
      x-xss-protection:
      - 1; mode=block
    status:
      code: 200
      message: OK
- request:
    body: '{"refund": {"carrier": "USPS", "tracking_codes": ["9400100105442285865323"]}}'
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '77'
      Content-Type:
      - application/json
      authorization:
      - <REDACTED>
      user-agent:
      - <REDACTED>
    method: POST
    uri: https://api.easypost.com/v2/refunds
  response:
    body:
      string: '[{"id": "rfnd_88027fb7873d4632b55b7d9eb370ce5f", "object": "Refund",
        "created_at": "2023-11-28T22:04:15Z", "updated_at": "2023-11-28T22:04:15Z",
        "tracking_code": "9400100105442285865323", "confirmation_number": null, "status":
        "submitted", "carrier": "USPS", "shipment_id": "shp_389b05acbbff44bfa104ee937676bace"}]'
    headers:
      cache-control:
      - private, no-cache, no-store
      content-length:
      - '297'
      content-type:
      - application/json; charset=utf-8
      expires:
      - '0'
      pragma:
      - no-cache
      referrer-policy:
      - strict-origin-when-cross-origin
      strict-transport-security:
      - max-age=31536000; includeSubDomains; preload
      transfer-encoding:
      - chunked
      x-backend:
      - easypost
      x-canary:
      - direct
      x-content-type-options:
      - nosniff
      x-download-options:
      - noopen
      x-ep-request-uuid:
      - 88ad7b8f656663dfe78a97f0003e3e20
      x-frame-options:
      - SAMEORIGIN
      x-node:
      - bigweb32nuq
      x-permitted-cross-domain-policies:
      - none
      x-proxied:
      - intlb1nuq b3de2c47ef
      - extlb1nuq 003ad9bca0
      x-runtime:
      - '0.090559'
      x-version-label:
      - easypost-202311250013-a0f06fbc2c-master
      x-xss-protection:
      - 1; mode=block
    status:
      code: 201
      message: Created
version: 1
